## Section 1

In [2]:
from sklearn.datasets import load_boston 
boston_house_prices_data = load_boston()

### Remove missing values

In [8]:
import pandas as pd
import numpy as np

In [13]:
num_rooms = pd.Series([
    1,2,3,4,5,None,np.nan

])

In [14]:
num_rooms.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [23]:
num_rooms[num_rooms.notnull()]

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [24]:
df = pd.DataFrame([
    [1,np.nan,2],
    [2,300,5],
    [1,np.nan,np.nan]
])
df

   0      1    2
0  1    NaN  2.0
1  2  300.0  5.0
2  1    NaN  NaN

In [29]:
df.isnull() ## FIND PLACES WITH NULL

       0      1      2
0  False   True  False
1  False  False  False
2  False   True   True

In [28]:
df.dropna() ## REMOVE ROWS WIH NULL VALUES

   0      1    2
1  2  300.0  5.0

In [31]:
df.mean() ## FIND MEAN - DEFAULT MEAN FOR COLUMN

0      1.333333
1    300.000000
2      3.500000
dtype: float64

In [34]:
df.fillna(df.mean()) ## FILL NA WITH COLUMN MEAN VALUES

   0      1    2
0  1  300.0  2.0
1  2  300.0  5.0
2  1  300.0  3.5

### Standardization and Normalization

In [35]:
data = [
    [1,2],[2,2],
    [2,4],[4,2]
]

In [37]:
from sklearn.preprocessing import StandardScaler

In [40]:
StandardScaler().fit_transform(data)

array([[-1.14707867, -0.57735027],
       [-0.22941573, -0.57735027],
       [-0.22941573,  1.73205081],
       [ 1.60591014, -0.57735027]])

In [41]:
from sklearn import preprocessing

In [45]:
preprocessing.normalize(data,norm='l2')

array([[0.4472136 , 0.89442719],
       [0.70710678, 0.70710678],
       [0.4472136 , 0.89442719],
       [0.89442719, 0.4472136 ]])

### Removing duplicate datas

In [49]:
df = pd.DataFrame(boston_house_prices_data.data)

In [50]:
df

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33
...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0.0,0.573,6.593,69.1,2.4786,1.0,273.0,21.0,391.99,9.67
502,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,396.90,9.08
503,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1.0,273.0,21.0,396.90,5.64
504,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1.0,273.0,21.0,393.45,6.48
505,0.04741,0.0,11.93,0.0,0.573,6.030,80.8,2.5050,1.0,273.0,21.0,396.90,7.88

In [58]:
df = df.append(df.iloc[0,:],ignore_index=True) ## JUST A EXAMPLE TO INSERT DUPLICATE VALUES , FOR NEXT EXAMPLE

In [61]:
df[df.duplicated()] ## GET SPECIFIC ROW DUPLICATED

,0,1,2,3,4,5,6,7,8,9,10,11,12
506,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.09,1.0,296.0,15.3,396.9,4.98

In [63]:
df = df.drop_duplicates() ## REMOVE DUPLICATES

In [64]:
df[df.duplicated()] ## GET SPECIFIC ROW DUPLICATED

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
Index: []

### Classification